package com.yl.payinterface.core.handle.impl.remit.klt100004.single;

/**
 * 开联通
 *
 * @author AnLin
 * @version V1.0.0
 * @since 2018/4/3
 */
public enum EBatchResponse {

	// 以E开头的用于批量整体
	E0000("正常"),

	E0001("报文格式错误"),

	E0002("版本号不能为空"),

	E0003("不支持的版本号"),

	E0004("字符集不能为空"),

	E0005("不支持的字符集"),

	E0006("商户号不能为空"),

	E0007("指定的商户号不存在"),

	E0008("商户批次号不能为空"),

	E0009("商户批次号超过长度限制"),

	E0010("重复提交（相同商户批次号已经存在）"),

	E0011("商户证书有误"),

	E0012("验证签名失败"),

	E0013("超过最大允许批量记录总数"),

	E0014("不支持的签名方式"),

	E0015("商户未授权接入网关"),

	E0016("商户未授权开展代付业务"),

	E0017("商户未授权开展任何发卡行的代付业务"),
	// 查询
	E0018("商户批次号不存在"),

	E0019("批次中不存在明细"),

	E0020("批次明细全部异常"),

	E0021("商户手续费设置有误"),

	E0022("指定的商户批次号不存在"),

	E0023("指定的商户批次明细为空"),

	// 以R开头的用于交易明细
	R0001("商户订单号不能为空"),

	R0002("商户订单号超过长度限制"),

	R0003("重复提交（相同商户订单号已经存在）"),

	R0004("收款方账号不能为空"),

	R0005("收款方账号超过长度限制"),

	R0006("收款方姓名不能为空"),

	R0007("收款方姓名超过长度限制"),

	R0008("收款方账户类型不能为空"),

	R0009("不支持的收款方账户类型"),

	R0010("收款方开户行行号超过长度限制"),

	R0011("收款方开户行名称不能为空"),

	R0012("收款方开户行名称超过长度限制"),

	R0013("商户未授权开展指定发卡行的代付业务"),

	R0014("交易金额不能为空"),

	R0015("交易金额格式有误"),

	R0016("通联解密失败"),

	R0017("收款方开户行名称有误"),

	R0018("用途超过长度限制"),

	R0019("备注超过长度限制");

	private String value;

	EBatchResponse(String value) {
		this.value = value;
	}

	public String getValue() {
		return value;
	}
}